{"layout":"post","title":"A conversion diagram","date":"2013-08-11 16:45:00","tags":["data-visualisation","d3.js"],"content":"\n\n<div id=\"conversionDiagramWrapper\"></div>\n\n<p>\nThis is an example of what a conversion diagram looks like. The data visualized here is the product conversion of a fake small webshop.\n</p>\n\n<p>\nThe first column represents the times a product is shown in the shop, the second how much it has been viewed by a customer and the third how many customers bought the product.\n</p>\n\n<!--excerpt-->\n<p>\nThe visualisation itself was build using the raw product data in json format and visualising it with the help of the javascript library <a href=\"http://www.d3js.org/\">D3 js</a>.\nThe javascript code for Conversion Diagram can be found <a href=\"/post-resources/conversiondiagram/conversionDiagram.js\">here</a>.\n</p>\n\n<p>\n\tEverything about it is open source and you can find it on <a href=\"http://github.com/sanstream/conversionDiagram\">github</a>. If you have any questions just drop me an email at sanstream[at]gmail.com.\n</p>\n\n<script src=\"/post-resources/conversiondiagram/conversionDiagram.js\" type=\"text/javascript\"></script>\n<link href=\"/post-resources/conversiondiagram/conversionDiagram.css\" rel=\"stylesheet\" type=\"text/css\">\n\n<script type=\"text/javascript\">\n// Adding the visualisation to the dom, when the dom is ready.\n\t$(document).addEvent('domready', function(){\n\n\t\tvar dataLocation = '/post-resources/conversiondiagram/';\n\t\t// Load the data from the json file:\n\t\td3.json( dataLocation + \"conversionData.json\", function(error,json) {\n\t\t\n\t\t\tif (error) return console.warn(error);\n\t\t\t\n\t\t\tconversion = new ConversionDiagram(json, '#conversionDiagramWrapper');\t\n\t\t});\n\t});\n\t\n</script>\n\n\n"}
{"layout":"post","title":"How this site was made","date":"2013-10-14 16:45:00","content":"\nThe obvious answer of course would be \"With HTML5, CSS and JavaScript.\" And that would be true, but there is more.\nWhile designing and building this site I used a variety of special techniques and methods, which deserve some extra explanation.\n\n<!--excerpt-->\n\n##The design: Responsive, so content first!\n\nThe most important thing for me was that people could go through my website as easy as possible and would be able to see and/or read what they wanted. \n[excerpt]\nI also wanted to make sure that the site could be used (read/seen/navigated through) on even the smallest devices. With that in mind I bought the most simple, cheapest and smallest phone I could find: The Samsung Galaxy Y. I used that phone as my primary testing platform.\n\nTo put it other words, the design had be guided by the content and had to be scalable from small to large screens. That meant that the design needed to be responsive.\nTo see what that means in practice, just resize your window and you will see the layout rearrange to make it as readable and usable as possible. That's what responsive design is.\n\n##Building\n\n###Using HTML5: making semantics important\n\nI didn't just use HTML5, because everyone was doing it and I wanted to be part of the cool kids. No I used it because it was so more better equiped to write sematically meaningful markup than all the previous versions.\n\nThe advantage of writing semantic correct HTML is that the markup describes the content better, but instead of just using the text book explanation, here is an example:\n\nIn the olden days of HTML4 (and in XHTML too) a simple website's HTML would look like this:\n\n{% highlight html  linenos %}\n\n    <html>\n        <head> ... </head>\n        <body>\n            <div class=\"article\">\n                <h1>Heading of the article</h1>\n                <p>\n                    First paragraph of the text\n                </p>\n            </div>\n\n            <div class=\"sideContent\">\n                ... Something related to the article, but not directly.\n            </div>\n        </body>\n    </html>\n\n{% endhighlight %}\n\nBut HTML5 introduced so more semantic tags and the HTML could look like this:\n\n{% highlight html  linenos %}\n\n    <html>\n        <head> ... </head>\n        <body>\n            <article>\n                <h1>Heading of the article</h1>\n                <p>\n                    First paragraph of the text\n                </p>\n            </article>\n\n            <aside>\n                ... Something related to the article, but not directly.\n            </aside>\n        </body>\n    </html>\n\n\n{% endhighlight %}\n\nThis means that the website, just on the basis of it HTML markup can be understood and read much easier than before. Which, in turn, also means that bots from Google, Bing and other search engine understand the content better too.\n\n###Using em values\nTraditionally most developers use pixels values to specify what the layout should look like. There are however two problems with that. \n1. It is unclear where a certain size of, for instance, a heading comes from.\n2. It is dificult to understand why something is a certain size to begin with.\n\nHere is a practical example explaining it:\n\n{% highlight css  linenos %}\n\n\n    /* The font in pixel values: */\n    body{\n        font-size: 12px;\n    }\n\n    h1{\n        font-size: 20px;\n    }\n\n    small{\n        font-size: 10px;\n    }\n\n    /* The same in em values: */\n    \n    body{\n        font-size: 12px; /* define a base size. */ \n    }\n\n    h1{\n        font-size: 1.8em; /* h1 headings are 1.8 times bigger than the base size. */ \n    }\n\n    small{\n        font-size: 0.8em; /* small text is 1.8 times bigger than the base size. */  \n    }\n\n{% endhighlight %}    \n\n###Minimizing the use of images: font icons\nOf course I had the issue that one of the main things shown on this website are in fact images, but I could reduce the load in other areas like the icons that I would use.\n\nLuckily arround that time a new idea came arround called font icons. Font icons are basically a font (or type face) in which all the glyphs (letters, numbers and other things) are replaced by images.\n\nThe fun (and useful) thing however about them are that they behave just like a letter of a regular font. That means they can be styled like any other text in the HTML with CSS. That means you can have a twitter logo in your favourite colour, about 2 em's big and with some cool shading. Nifty ey!"}
{"layout":"post","title":"Mapping human emotions","content":"\nI thought it would be fun to map the  human emotions and see how they relate to each other, so I did. But what is it and what does it do? The three dimensional diagram shows 4 axis that each represent one of the basic four emotions (happiness, Fear/supprise, anger/disgust and sadness). Most emotions are can measured in severity of one of them. For instance disappoinment is anger at a low intensity, while rage is anger at a high intensity. Some however are composed out of 2 or 3 basic emotions. But hey, just take a look for yourself.\n\nYou can rotate it, click on emotions and read more about them. Go ahead and try it.\n\n<!--excerpt-->\n\n{% include /posts/charting-emotions/index.html %}\n\n## How I did the research and stuff\n\nOf course everything was easier said than done. I did have some sketches and ideas on how I would to map things, but I knew I should not be guided by some whimsical thoughts on data-visualisations. So like in any project that involves data, I started with the data-model and worked my way from there.\n\nFirst of all I needed a classification system. I remembered there was a theory that there were four basal emotions: **fear**, **anger**, **joy** and **sadness**. But I was not going to be led by some vague memory. I was going to do it all sciency.\n\nAfter some digging I found out there was a theory of there being six basal emotions proposed by Dr Paul Ekman and a theory of 8 emotions illustrated by Plutchik's wheel [[2](#2)]. In fact there seems to be a whole lot of disagreement on the subject [[3](#3)]\n\nFinally I found a recent article proposing that we infact have only four basic emotions, **fear/supprise**, **anger/disgust**, **joy** and **sadness**.[[6](#6)]. I used this as my basis for setting up my dataset.\n\n## How it works, on the inside.\n\nThe engine that builds up the graphic it a shmoosing of [d3.js](http://www.d3js.org) (the data driven part) and [Three.js](http://threejs.org) suggested by [@Makc3d](https://twitter.com/makc3d), [Using d3 with Three.js](https://makc3d.wordpress.com/2013/10/30/using-d3-js-with-three-js/). A lot of the math tools come from JavaScript itself and Three.js. The position calculation I figured out on my own and can be viewed by just inspecting the source code. I you have some in depth questions just ask them below in the comments.\n\n## Sources:\n\n* <span id=\"1\"/> list of emotions: [http://www.sonoma.edu/users/s/swijtink/teaching/philosophy_101/paper1/listemotions.htm](http://www.sonoma.edu/users/s/swijtink/teaching/philosophy_101/paper1/listemotions.htm)\n* <span id=\"2\"/> Plutchik's article: [http://web.archive.org/web/20010716082847/http://americanscientist.org/articles/01articles/Plutchik.html](http://web.archive.org/web/20010716082847/http://americanscientist.org/articles/01articles/Plutchik.html)\n* <span id=\"3\"/> Disagreement in the scientific community about the classification of emotions [http://changingminds.org/explanations/emotions/basic%20emotions.htm](http://changingminds.org/explanations/emotions/basic%20emotions.htm).\n* <span id=\"4\"/> three.js (a javascript abstraction ontop of WebGL): [http://threejs.org/](http://threejs.org/).\n* <span id=\"5\"/> d3.js (javascript library for data-driven documents (HTML, SVG or whatever) ): [http://d3js.org](http://d3js.org)\n* <span id=\"6\"/> The four basic human emotions: [http://www.gla.ac.uk/news/headline_306019_en.html](http://www.gla.ac.uk/news/headline_306019_en.html)\n"}
{"layout":"post","title":"A shimmering circle","date":"2017-05-26","tags":["creative coding","generative art","d3.js"],"content":"\n\nThis animation was first inspired by the circular symetrical pattern of fruit arranged on pies, but slowly turned into something a bit more esoterical.\n\n<script type=\"text/javascript\" src=\"/post-resources/shimmering-circle/js/main.js\"></script>\n<svg id=\"shimmering-circle-1\" style=\"width:960px;max-width:100%;\"></svg>\n\n<!--excerpt-->\n\nIf you are interested in how it is made you could have a look at [the source code on github](https://github.com/sanstream/shimmering-circle).\n"}
{"layout":"post","title":"Most Spoken Languages - a write up","date":"2019-12-30","tags":["creative coding","data visualisation"],"content":"\nOn 2019-12-30 I published a tool to help people understand which common languages are spoken where, called [the most spoken languages](https://most-spoken-languages.sanstream.nl/).\n\n![Screenshot of the application](/img/posts/most-spoken-languages.png)\n\n<!--excerpt-->\n\n\n"}
